### Import necessary libraries

In [1]:
import pandas as pd

## Task1:  Read the data and clean up

#### Read books

In [51]:
books=pd.read_csv("./Data/Book_reviews/BX-Books.csv", engine="python", sep=',', quotechar='"' )
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,NaN,NaN,NaN,NaN
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,NaN,NaN,NaN,NaN
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,NaN,NaN,NaN,NaN
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,NaN,NaN,NaN,NaN
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,NaN,NaN,NaN,NaN

#### Read users

In [30]:
users=pd.read_csv("./Data/Book_reviews/BX-Users.csv", engine="python", sep=',', quotechar='"' )
users.head()

,User-ID,Location,Age,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,1,"nyc, new york, usa",NaN,NaN,NaN,NaN
1,2,"stockton, california, usa",18,NaN,NaN,NaN
2,3,"moscow, yukon territory, russia",NaN,NaN,NaN,NaN
3,4,"porto, v.n.gaia, portugal",17,NaN,NaN,NaN
4,5,"farnborough, hants, united kingdom",NaN,NaN,NaN,NaN

#### Read ratings

In [11]:
ratings=pd.read_csv("./Data/Book_reviews/BX-Book-Ratings.csv", engine="python", sep=',', quotechar='"' )
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X          0.0
1   276726  0155061224          5.0
2   276727  0446520802          0.0
3   276729  052165615X          3.0
4   276729  0521795028          6.0

#### Table cleaning

In [42]:
users = users.drop(['Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5'], axis=1)
print(users)

        User-ID                            Location  Age          Country
0             1                  nyc, new york, usa  NaN              usa
1             2           stockton, california, usa   18              usa
2             3     moscow, yukon territory, russia  NaN           russia
3             4           porto, v.n.gaia, portugal   17         portugal
4             5  farnborough, hants, united kingdom  NaN   united kingdom
...         ...                                 ...  ...              ...
278846   278854               portland, oregon, usa  NaN              usa
278847   278855  tacoma, washington, united kingdom   50   united kingdom
278848   278856           brampton, ontario, canada  NaN           canada
278849   278857           knoxville, tennessee, usa  NaN              usa
278850   278858                dublin, n/a, ireland  NaN          ireland

[278851 rows x 4 columns]

In [ ]:
books = books.drop(['Unnamed: 8','Unnamed: 9','Unnamed: 10', 'Unnamed: 11'], axis=1)
print(books)

In [82]:
b=books[pd.to_numeric(books['Year-Of-Publication'], errors='coerce').notnull()]

In [124]:
ratings = ratings[(ratings[['Book-Rating']] != 0).all(axis=1)]

### Augment data with additional columns

##### Add Country column in users data

In [43]:
users['Country']=users['Location'].str.split(',').str[2]
users['Country']=users['Country'].astype('str')
users.head()

   User-ID                            Location  Age          Country
0        1                  nyc, new york, usa  NaN              usa
1        2           stockton, california, usa   18              usa
2        3     moscow, yukon territory, russia  NaN           russia
3        4           porto, v.n.gaia, portugal   17         portugal
4        5  farnborough, hants, united kingdom  NaN   united kingdom

### Analysis

#### Question 1: Which publisher has the least books?

In [66]:
publisher=books['Publisher'].value_counts()
print(publisher)

Harlequin                                                                                                              7536
Silhouette                                                                                                             4220
Pocket                                                                                                                 3903
Ballantine Books                                                                                                       3780
Bantam Books                                                                                                           3646
                                                                                                                       ...
Narcissus Publications in association with Central Europe Review and Central and East European New Media Initiative       1
Humanist Press                                                                                                            1
Swedenborg Foundation Inc                                                                                                 1
Nickelodeon Pr                                                                                                            1
Anita Roddick Books                                                                                                       1
Name: Publisher, Length: 17024, dtype: int64

#### Question 2: Which year has maximum number of publicised books?

In [83]:
year=b['Year-Of-Publication'].value_counts()
print(year)

2002    17616
1999    17416
2001    17349
2000    17223
1998    15749
        ...
2038        1
2037        1
1806        1
1910        1
1378        1
Name: Year-Of-Publication, Length: 116, dtype: int64

#### Question 3: Which country has the most users?

In [84]:
country=users['Country'].value_counts()
print(country)

 usa               139184
 canada             21558
 united kingdom     18287
 germany            17022
 spain              13103
                    ...
 madagascar             1
 region iv              1
 unit                   1
 washtenaw              1
 solano                 1
Name: Country, Length: 1029, dtype: int64

#### Question 4: Which books are Top 10?

In [131]:
best_book=pd.merge(ratings, books, on='ISBN', how='inner')

In [133]:
x=best_book.groupby('Book-Title')['Book-Rating'].mean()
sorted_data = x.sort_values( ascending=False)
sorted_data.head(10)

Book-Title
Miracle on the 17th Green : A Novel about Life, Love, Family, Miracles ... and Golf                          10.0
Holiday Prayer (Christmas Flash) (Love Inspired)                                                             10.0
The Witness of Combines                                                                                      10.0
Sailing: Impressions, Ideas, Deeds                                                                           10.0
Holidays for Doosie. Eine Reise durch Europa oder Englisch mit Liebe.                                        10.0
Holidays Around the World (Bantam Begin-to-Learn Series)                                                     10.0
Holiday Touches for the Country Home                                                                         10.0
The Wives' Tale                                                                                              10.0
The Wiz Biz                                                                                                  10.0
The Keeper's Companion: Blasphemous Knowledge, Forbidden Secrets, and Handy Information (Call of Cthulhu)    10.0
Name: Book-Rating, dtype: float64

#### Question 5: Which publisher has the best books? (by book rating)

In [136]:
publisher=best_book.groupby('Publisher')['Book-Rating'].mean()
sort_publishers=publisher.sort_values( ascending=False)
sort_publishers.head(1)

Publisher
 Editions P. Terrail    10.0
Name: Book-Rating, dtype: float64